# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSourceSet..::..Erase Method
PaperSourceSet Class See Also
---
Removes a specified object from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	PaperSource item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As PaperSource _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	PaperSource^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PaperSourceThe item to be erased.
# ### Return Value
The number of items that were erased from the set.
# See Also
PaperSourceSet Class
Autodesk.Revit.DB Namespace